node {
  name: "global_step/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/initial_value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "output"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "X"
      }
    }
  }
}
node {
  name: "HistogramSummary"
  op: "HistogramSummary"
  input: "HistogramSummary/tag"
  input: "input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y"
      }
    }
  }
}
node {
  name: "HistogramSummary_1"
  op: "HistogramSummary"
  input: "HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
          dim {
            size: 150
          }
        }
        tensor_content: "\352\033\330=\337\260\253\274\321\243\236\275\223\373\036\276\027\020\365<^\350\000\275\3707D\276\220\315\275=\261\356 \276@\377#>\3545\232\275\320\374B\276\201m\304=\306\361\'\276\014`)\276\006\031A;\212\364\035\275I\347(\276\210mm=\231\335\270<\232\2472\275V\2341\276\316\217\006;\310\266\303\275v\232\037>\214\227\016\276[W\345<\360\223\340\275G{+>\326jv=V\217\232\273\353\317\025\276tG=>^\274\311=\267\207]<\242\215\010>\024\212\266;\2132y9\035_\331\274\261\0005\276\217\313I\275\225\311\347<\211\355\025\276\315\3050>\336\3338\276\315\334\226\274\252\355\030\276k\2606\276(\354\311<\352\203\275\275:\201;>\n\222 \276\030q\320<B\210\330\275\333\312#=\223\331\002>\021\355\022\2766n\r\275\223&%\276[I\226=\212\217\352<\347\366/\276\374C \276^\375B\276\246\307\216=t\227\225<GV\346=a\rL<=tF>\262Y\333=k\257 =+\256\232=\244\026=>\220\031\230\2751\000O=\241\271\006\275\305\2357>\326\254\020>\036O\026>[\327B\276\234\343L=\337R\276\274S\251\304\275\203\307\240\275F\nj\274s\264!>\325O\330=P\247\014\275\037\3403\276\000\345\'\275G\376\337\274\343\000\300\275\271\304\017>\304\235\r\275u\216)>n\305\271<\275\000\264=\371\311X\275n\376\004\276U\003?\27623\017\276`c\242\275\266ui\275c\025\023>\301\216\322=\321\004\256=\377r\033\274Lq\"\2769cW\275\2072\227;\302\366\310=-\004\027\276\254\";\276]i\311=\3774;\2766\255\005\275\242\231\250<\251\204\216=\337\307\010\276\375Cd=\334\350\226=8\3167>\315\337/>\020\244/=j\\!>,\032\313\2757\343\341\275\200\367\365\275>\323\322=(\302\007>DU\205=\003W\333=\351\243^=\240\220\035\276u\304\370\2754\0025;\253\013\024\276\024A\236\275M\023\215\275-a\274\275+K\210\274\220\250\376=~]==:\034\247=r\277&>\220Y\276=\2537-\276\241\232\241=4\023\235\274.\232\223\275\010\t$=\240\025\235\274T\321\240\275\205\331+<}\312\236\275\306\334\032>\363\034\027\275\215\030\310<]\370-\275(ha<\243{\371= \037\n>\330\214/\276cA\247\275\265\326\354\275\235\217\222=\352M\251\275Fj\271\274o\264\207=\255-\205\275\303_;\276\026\226\020\275\242\310\027=\277Z\354=\241\344/\276w\352\306=0\307\000=\003\007\316\273\0065 >\260<\314\275\356\223\250\275<$/=\256\233w\275\027q\'>7\213:\275\323\234V=\256^4=\031\375\265;\212p\027\276\036\346\003\276\321a\371\275R\254\236\275:1\n>s\261\353<\217R;>\237/\360\275\230\271A\276G\317\200=jJ\017\276\242\340\335\275%\314?>\335(5\276\217\205>>\203\3557\276\013\201\"\2763\006E>\372\376\013>\334\235\003\276\326\331$\2760\347\322\275\345G\014\276\277\333\227\274m\302\002>\002\202\263=\177c\026>ot\022\276\001l6=b/\235=\316\222:>\\\341\n\275\320\030\271=\240\221\005=\347v\270<0,W\275\270\274\332\275\257\336\334<\300B>>\034!\263\274T`\030\275\026\350\024>\342\366\014\276G\323\257\275\366q\327=J\333\334;O\210\247\275\241\013\021\273\022\262#>2k\262=\010_5>\302\205A=Z\036E\276\000j|=5U4\2760x4>\022w\261<\033\274\032\276=94>\362O\277\275\315\003\317=\030j\013\276\267\262\243=\006\020\354=$8,\276;\315\207\275\013\334\370\275x\366\272<\235\014?>\033O\007>\375x\243\275?\014\220\275g\004-=\216\260\031>\264\000G=M~\032\276^\300A\273\322\304\206=!\312~\275\2618-\276S~\263\275\325]<\276\346w\036>~\301C=\030 0\276\345\332X\275\24776\276-\271\006<\233\t\324\275\034\203\305\274L\t\030\276a\243\263=\233X\356\274\266\344!\276b\034\254=l\032\301=I\364\214=\335k\005\276\032E\355\275\355X\261\275d\335\255<[c\036\276\372\302\356<\333\270\322\275\316I#\276\377\3773\276\2370\n>\2278\n\2766\237\035=\367\203~=j\265\363<\237\342\347\274\372\3406\276T\\\031\275\206\370\347<\270\215/\276|\254\000\276\023)\235\274J\254\016\276\372\236\000\276\002\354\342\2745\257?;\016\351\265\275my\030\276\034\252\304\275}R\020>\356r\235\275\363\240\005\275v\273$>AP\023\275\270P\004\276\030\336\257\274\317\223\372\274\022i\342=\020`U=\361L\301\275\216j%\276\216\223\212=2\265\337\275\\\"F>\314^\207=\305\336+\276:\321b<e\267\210=\276\372\254=:\255\351\275\310\253L=)\224\t=\"F\030\276p\364;\276m\002\203=\262\234\016>)\323\220\275\204J\343=k\022G>N\357\327\275\311\2735\274\016\325;>\034\036\245\275\017\253\330\274\310\303>\276\246\361\013=(o\002\276(7\327=DKg=\377P\006\276\337\252\034\276\222M\331=\226w\312<\013\330\r=\013\267\037\275\242\364f\271\373\325\255\2755Ib\275\343\266\270=\035G\035\276|lE\276\243H9>ot\323=\357e\016=a7%>\364\245\033\276j5\033\272G\227;=\377hA>\302\032\027>3\241\021\2764\0107\275\nP)\276>\352J\275\324\332\241\274\023\201q<R\0247\276.\307\242=\335D\210\275\334\377\262\275\231\255(\276\177\204\245=\"\313\326=\020\362\035\276)\024\025\275\321\366\000>3KC>\r\273\367\275\262\365\360=\321\235\242;z\357s\271?Z)\276\355\354\325\275\301\367F>\353R\275\275^\326<>+m\375\275\314Z\206\275X\030\373<\327\232\r>)\201\204=\002_\202\275\0313\272=\014\226\'\275z\306l=\003]\274\275)2\330={A\370\275\370\227\320\275T|\270\275\246\337\257\275\247\002/\276 \256\340=x\026\026=\216\313%\276\214#_\275>\352\005>\277^\226\275S\2569\276\356\252->\304E\002\275L\035o\275\344[\244=\222f\036\276\253{\207\275-\035\037>\355Q\221\2750\030\031>.H\'>6$5\276\014\274\241\274\301\n\024\276C\3712\274;3U\275\247\024_\275\024\235>>y\220)\276b\324$\276\021\230\321\275dM\372=E\'\360=G\357\033=\222\221\337=\354\250<<\236S*>#P\r>\364\0043>\325\177\326<Z\331\225\274)\241\273=Q\030>\276\327.P\275\032\032=>\337W\223\275\252\030\347=G\357\376\275<\2631>Q. \276\231\303\213\274\253\371\344\27544\205\274=Y\t\276\224\223\367\275\022H\027\275\nx>>*\003A>\003\024&>\224x\204\275f\267\242\275\355\257\353=\032\261y\275\225(I\275\2126\246\275\235\330#\276\330_\355\275R\360\014\275\255~\253=3\253,=JjN=\333\017\302=\363\357\271=\013\273\013>\n8\023>\206\362\317\275G\014\030\276\250\366S\274\2721\242=[\224,=mK(\276\250\316\247\274\261\000\034>^\344\026>$n\300\275\375\367\260;3\366\t\276\225S\">\263\255l\275\227\007\003\274BY\010\276pl\">up\304\275l\324\014=\037O\234=9\363(\276K\323F>K\353\304=Z3\227\275\026)\007\276!l\312\273|1\347;\343\250\362\275g\366/>\235\202$\276\374\273\206=\'\303\022\276\271\036\305\275~\243H\275\343\276\321<\306\374\n=\000)\364=\2257x=\301h-<\310\022\336=\212\223\006\276\245\2404=\004\334\215=\272RL\2757\t(>\376`\302\275`\320\032\276\363\023\033<\004\335\224\2739@E\276\022\"\347=>d\025\276\350\363\"\276*<\204:h\312]\275\373e\232=\205\332\232=\330ld<\262\255\256=x\377\r\276\033\364\326\275M\227r\275\010\352\022\276\265\201/\276\376\'*>y\354 >\254\210\232\275\373x\321=\227O*\276i\370\010\276\3634\237\275\030o\373=\201\277\030>w_\034>\020\217\003\276i\352\221=m:<\276\254k#=lz\351\275\027\022\344<\030q\311=3t9\276\224\203\007\275f\263\331:\345f\304=r\332\002\276\227\306\210=\341\001{\274\217\021$\275\367\330\031\276A{\273\275W\342\271\275\006\021\370\274\016\000$>p\0161>\325\200\234\275\264A\377\275\313\325\027\2766\344\037\275\277\341\376\275:\345\333\275},\364\275\034\315i<\364\351\373\274\016E$\276-\216\217\273\021\350.\276\265}\n>\375\212\225=\260\026\337<\246\332\352\274b\177\213=Vo2>\247`\361\275_\325\333=\300\315\025\276\266\262\032\276\"\373\260\275\344\226\n=b:\022\275c\317.\276\021\210\r>KM\'>\261\217\027\276b\245\214\273\n\203@\276H\031\264=\312\3670\276\254\r+\276,t\n\275E\374!\276v\003\036>\356\224\014>\307U.>\255H\037>E\344\304\275;l\005\276w\323\002\276\246\270\364=\005\342\372\275@\201\250\275\213\202=>\363\255+>\234\346&>q\277\025\276~\023\371<-|+>\1776:=\251\220\203=\331\353\275\275\303\230\326:\225\343E<6\376\252=Kn\250\274\262\331\035=\217*\3529\301\365\205\274/\234\027>V\222F>\327\200\021>g\271\327\275\2013x\275\252\376\">Z> \276\023\365\017\275:\327\371;\232\367\212\275|$\023\276\267\204K\274\212\227\276\275\221x\n\276^\035w\274\022\313\020>\273U\265\275\222\212\231=;<\251\275\355R\367=\271\n\301\275.[2<\277\371!>\355\317a\274\267cA>\246\223\036\2762\344M\275\246`@\276\304\207N=\277\316,\275\235\3479\276F\n\331\275\353\274h<\177\213\010\276\260G\030<\032\006$>}\006\255\274\305C\265<A\314\021>\251\210t=\271\265;\276\232\201\022>:\013\213\275?/\233\275\371m\035><0\331=]B\022>Y\246\000=\350I\177\275\036\367~=\r\021\013\276\312ML=\331I:\276qT\013>&\272#>\203T\322<\331\343x\275\373\351=\2755\371\352=\246\300\267\275\337\323-\276\363\0169>\323\211\214\274\3014\356=\3564\347\275Gu\\=\242\020\234\274\245\373:>\207\303\262=\315m\254=\003\006\330<\222\355\366\275\231 \204=Re\221\275KD:\276n\255%\276\210\227\212=\305`\300=q\373\201\275\343\035\215\275\207\254\014>\227\235\027>\305\244\344\275\335\366\013=\364\r\322\275\375\001\275\275Qi\253\275\215\r\267\271\206S\223=\364\017\356=#h\002>\302\307\214=\202\2649=\211\247\360\275|\017\032=\336\242A>\275\211\306=\245u\007\275\276o\360=]a\344\275+\255\352=h\256\251<T\227\346=\271A\211=\373\237\336=\264\000\023\276\375c\003\276\010\300!>\213\010\n>\370\0106\276\232Y#\276\307\275\260\274\337\322\002\276X>\302\275A\030\031>o\023\217=\335\350\'>\321\332\325\275\315ZA>+n#>\304\204\313;\246\226\324\274\334c <A\236\367=~\361\276\275\213\261\">}\354\353=\262]3\276\337\216\334\275\006\211\034=\367\302\034>\360\323\376<\214Y\004>\373=\004>\2357\002\275\266\302\266=N{\355=\030\254\272\273\317\321\312\275\332-\006\276\252\027\225\275{\244\000>\205\233H\274\214\245\034>\036/\">,(B\275\222\031\025>\246\334\314=z\203\236=8\027\232\275(S\033>\"\032a=\303e6\276\317\325T<\207\367\021\276k\217a\275\363\3116>\035\031<\276H\254\273\275e\264}\267\363\232q\275\225-\361=\306rN=\000h\263\274X\300\006>u\367)>\024\377\'>\013\331\"\276}\260\036>m\263\270\275\256!\006>\006\370\004>I*p\275\357\004\021\275\205f\212\275-\202\301\275\277\352\036>\340\213\372=\366F\020\276GDE>-_\237\275\365\225$=\327LC>\231k4\274Q\026\014==\375\347=\365\350\377<X+5\275z\372\352\275\326\365\322<\330\2246\275\313\316\346\275\276;\243\275gY\034\274\373Q\204=\026J\245=U\004\003\276\257\355\353\275|\2536<-uY;\211\341\034>\273\032\334\275\r\341\362<Y\236(>H\323==G\002\337\275\r)p=\332u\310<\366\202\211;Qm\037=8\335*\276\254\020h=\027\276/<U\205\r\272\273p\266\275\363\212G=|\364;=d\206\037>\316\313\356=#\306\021\276\230D\346\275\033\331\273\275q;I=?`\017=\351U5\275\177\2452=\252\346\226\274\317\037\315\275\021m\013\276\277h\227<\213.\332=\316b|\275G\355!>\340\224\344=\225\344\030\276\376\236\004>\315u7>\024\360\005=\235B\020\276\233y\355\275\235?\262<\313`\352=\2272\013\275\300u\333\275{Fl=g] =$\203Y\2758\031\376\275\354k\005=\3541\273<fX\031>\251\255\276\273\237\177=\276\244\177\010>]\300\336\275\317H\316\275\277U \276\307\310\333=D\250\257\275\320\323\001\275{h\322\274\331\346\301\275\342C=>\322\025\323\275\266\376\306=o\201\010>:\273\233\275\213\251\337\275\244+\005>\245\0100\275\254[#\276\017]\010\276\n\306Y\274W\230\332\2748\353d\275\343K\316\272\235A\337\274\362\214K=\006o\007=\342\201\331<\302\220\035\276\2224\210\275\222jY=\244\245\207=\207\027d=()\314<w\335\027>&\357\311=\207\216$\276\020\3338>\222\261\276\275d\304\276=AfD;\223\2416\275x\225\022\275R\356\316=\234\226\262;D\3678>\000l\004>\034\2326>fq=>\254\307&>\320\326\013\274\256\217\355=\226C\246\275\177\245E\276\270uJ:\243\340\316=\035q]\275\242F\r=R\207\303=\351\211O\274\332)\273\275\243Fb=\244{\016>\231i\027\276a\024\204=\177J\003>\242O\242\274[Z\225=XD\234\275\351A\n>IbA\276\276\244.\276e\300(\276\325\2165<\260t\316\275Q\341k\275\\\360\244;\354>\005\275nA\005\276M\353\210=&\377&\276S\177e\275\225}\342\274\336\257\354=\255\307\200\274\270\205\013>\373s\204=\"\320\237\274D\377V=\241k#>\204\360u\275\214\241\363<\021\255\223\274\312b6;\242\375\272\275\016\007\243=\231H\007\276\314\342P=\2659\307=\021\365\030\276\357\035+>\257\251\017\275\206\262\031=\303\256\032\276\202<A>k\343\273\275+\244A>\355\370y\275r\342\272\275l\274\346<\365\366\373\275\005#\206\273\215Z\360<\352\210\327\275\311r\033\276\224!\340;{\344\311\275T@\355\275\356z\260\275Cd7=\241\335 =O\377\231=\023\000\235\275\246\326/\276p\213\353\275\240Q\t>y\177\252=\253=+\276A\2622\275/+\242<\253\026\022>\322\307<>\306\303\036>\002\302\036>^n\007\276\001\360\255<\3048b=\262\375\365=\370t\027\276\355\361y\274\355I1>{\247%\276\355j8\276\230\255\366\274\346^\206\275\023q\010=\227\334\301\273\225\372c;\030*\274=}\233\n\276:\027\377\275\347\240\'=!\022\006\274\251\206)\276\324\344m\274\222\224\024\276\353h\254<\217g3\276\001\010n=\224\362\034>\273\241\t\276@\305\322\2753\014\351\274aB(\276D\361\226=\227\022V=\321)\n=%\360\031\276v9\320=z\255k;\205\205\342<\324}\272\275b\340-\276\026\356\025\275a2\031=\226Y\010\276w\031\312=[\235+>\274K\356\275\300\222\271\275\256z\273\275\337\344\324=<\247\215\275\263\304*\276\236\377\270=RU@>\262 \007>\345\007?\276\023j\000\276\177\325G\275\023\240\234<\346\201\300=\327\020\373\275\371\354\334=i\300\254\275\207\232(>8\247:\276\341U4\275\3201\206\2754\250#\276\n\021<\276\000\366\346=f?A>\034\032\033>\253@4\276WG\036>\217\3600\276\'$\261=\300r\032<;\321\306\274\325\256\362\275\ro\371\274\372<Z=3\375`<d\341\305\275\332\352 =`L\035>\212\342\305\275\216\3445\276,\004\030\276\004#\037\276\341 ->\203\323!=\202\211\004\276\264\327\006\276/\355\t>\305l\222\275\364}\357\275\3748\033\276\267<\263\275z;.>h\255A=\363\215B\2767\235y=\245\3725\275\373\225B>\354\304\214\275e\227\266\275\237\344)=\005\272\375\274~f\213\275\247\n\343\275@4<>\313\002\273\275P\366<\275a\221\004\275\260L\253=\340)\220\273\201\374\272=\023\236:>\31380>\267\230\'\276\376\341\204=\352\215#>\006o*\276x\316\355=\007\334\340\275\001\370\030\276K\261\257:M\273\343=\010lQ\2741\341\021\276<\355\007>\330\275\037\276\204\350\374=Y\027F\276$\300i\275E\247\234\275\010\"\205<$\033\340\274i\351\t\276\305\345_;\034\021\336=\002\215->\005\032\020\276\2072\206\274T\036;>\315\273\246\275=\r\034>\365\226{\275\n\351*\276\347\333S\272\316\276\313;\320\002\343=\247\355==L\306\267\275\211h\231\275\364\004\347\2751\022\265<pV\271\275\274\326\231=\346O\245=\366\3374\276E|\036\273\375\362\245=\016\2550\276\251\017\337\275\200\205\337\275\253\212\263\274\037\274\263=\014,\256=\316\213K;\273o\010>\'\006|\274"
      }
    }
  }
}
node {
  name: "fully_connected/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/weights/Assign"
  op: "Assign"
  input: "fully_connected/weights"
  input: "fully_connected/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/weights/read"
  op: "Identity"
  input: "fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/MatMul"
  op: "MatMul"
  input: "input"
  input: "fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected/bias/Assign"
  op: "Assign"
  input: "fully_connected/bias"
  input: "fully_connected/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected/bias/read"
  op: "Identity"
  input: "fully_connected/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected/MatMul"
  input: "fully_connected/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected/Relu"
  op: "Relu"
  input: "fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "S*\003>\035\320\000\276\\\210\030>4\2749\271\306\361;>\202\260H\276\237A+>\371NQ=C9\236\275S\234\200\2750;\021\276\246$\250\273S\t\032>+\003\230\274\301\265!\2748\217\032>\230d\207=:\013)\276\021\340>\276$\345\261=\226A\253=\024\001:\276\210\332[\274\211kV\275\031q =<\250\265=\206\006\371\275\232\2046<\313\235\250\275\354\273\021\276\026T8>\273\332)=\320\332%>\371^\210\274\206\2138\276\336\365\026\276\321\277\205\275\356\241\250\274\267f\357\274rZ\236<\007\013\332=\023\254*>T\337\311=\250\342\247\275\240%\370\275\376\220\301\275\\\311\266=\216L\223\274%\364\004\276\344Sf=\324\360E\276`\025\331=e\204\303\275\233Z\273\275v\021\306\273\324\021\214\275\264\177M\275\310m\"\276\262b:\276h\266\374\275\333%\022\276\t\335\200\275\344S=>\3702\030\276\265\022\207=\256m\353<\252\307\270=\207j\263\274\342\227\014\274g\337\315\275\300(\027\276\244\261\005>\210\270\200=\255H~\275\264\'\002>\223\222\355=\336G\"\274_s\324\274\206|\031\276 {A>a\032l=\000\215\357\275N\271\201=\255X\'>\304\030C\276G<E\276\331\027-=U\322?\275\221\034\367=,\356e\275\363\243\036>0-\223=\367\033;=\277,%>\306\274B=\371&\021\276!\370\">\317\256\304<-:\024>\251s#>\002\322.\276r\314\025\276\023\347G>)\267\333\275\214\255\334;g\234\004\276\326i\233=\201-\272\274\026\321\336\275\013\253M\274g\352\027>\320w\021\275m5\226\275zo\025>\361\232\351\275\343\236\206\275n\346\364=\360\316\346=\022%\r\275\276\3239<\3417>>\362${\275\346\261\213<\311j\240=\346\r>>\365\250&\2758\232\247=H\215\225<n\244\251\274D\310\263\273I\331\211=(=\345\275\215W\025\276\311\014\007>\n\321\026>\273\345\260=\275\205C>\372\237.<s\272\002<\365\344\n\276\3551\276\275T\354\252\275O\370\201\275\251\257\222<!r\314=\276j\366\274(\353\007\276\370\270\023\276y*\r\276\242/?\276\264\"S\275\331RF>\261M!>`\352 \276\027(\320=\r\'\340=m\004\220\275\217\371\351\275\027\252\032=G\351\037\276\200\241\376\275\317\266\376=\376f \276\334\370\006>\223\233\026\276#\200\233\275w\222\237\275t\321B\276\204\004w=K\203)\276\371\366\356=\353f,>1\205\315=\241\366\227\274\240\277\322=\210}\203=N\"\016>\307R\034\276i9\251\274#J\204=t\r\007=\2210;=\267\243\013>F\001\005>\373\266\036=U\264\277=|\316>\276\255\264\243=W\031C>\321TC>\367\206\276\275\213\276\267=\034\330\330=\030\3202\275\201\354\033\275b\370n\275&\210\001\276\341\227\354\275MO\323\27358<\275\265I6>\'dt\275\337\220d\275k\023$\276\033\364\027>\314\3652\276\024D\022>4\031*\275\000>\347\275\345N\253\275\364\010\235\275\272\024>\276\244\3579>4V\035>\314\025\031\274iG\034\276I\024\000\276&\031Y=\327t\225\273\027u\224=\237\310\004>\312\364\310=\034R\227<\340\242,\276\277\3154\276\204\335\301\274\317\341\016\276\324]\000<E7<>z\2761>f\t\270\274\207\033\021\276b\320#>:\217E\275\345,0\275td\013\275\253&t\274\036TC\276\311V\343\2752\001\"\276\201\317\212\2729\'\030>\275J><3g\373\275|\244\274\275\372\321/>\021\254\360<\362\244$=~\005\037\276\355\227j\275S\033D>t\272\355\275\300\023\001\276C\313\271\275\312ur<\355.\276\275\312~\037\276\234\2040\276\353\217\356<\351=\010\276\244\354\263\275\355D\364\275\2232W\275\346\376\233\275lu\003\276\304f\014>`\311\026\276T\320\010>\2569\332<\026\276\277;\352\363j=\265\235\311\275\0030u\275\023\037Q=\273\370!>\226\360\031>x\023\263\275$\2633>\274\016\251=\325\037\220<\235Q\317\275\365T\023>\303\3258\276\251\241\276=e\026\034\276\337\232\213\275\227\371.>`B\334=\351\230H\276\317\267\225\275\301\317\321=\236\026\342<\364\224\031>O\021\331\274\004en\274\2370\342\275\245? =\034\032<\276\r\256\313=\023\255G\276\355Z0>\006\231\266\275s\335\230<\355n\301\275 m\022>\"\214\201\273\221\221E>\200w\335\275\220\263\317=\321}\325\275OR\037=\347\355\373=k\315>>\317\213W<\372l\'\2765\327\000\276\002V\372=iz\242<\257\3572<\024\016\024>\202\374$\275\021\342\225\275\244\324\352<\242\273>>\256n7>Z]\014\276\033!\224\274\202\'Z\273\350_,=p\'\261\274\304b\260=\311\251\312\275\026Dv\275\005\013\001\275\277]\257=w\321\310\275\263\316;>\346\034z=\221\2746=:X1\276\334H\004\275S\205C>\335u\236\275\215\246\350\274\230\334o=\223\344\030>\2406\312\275u\353*\274\r}\022\276`i/\276\002iM\275\022\234b=K\033\230=\177Z >\253\277\343=l\215G>\336q9\273\306\266\325\275\262@\232\273\346\363l=\346\335\027\275m\032\343\275\3068*>\034Z\214\275*\243\341\275\r\375\341=\302\301->\t\375\032\276q=\247=\370\305\365\275-\031)\275n4\"=\342\037\032>q\016\373\273\354\361=\274\221`\311\275\334}.=\252\022\346=~\233\306=\025\341\235\275\271\237\304<rC[=p\224?\276\364z\351\275\n\257)=<\232\372=4U\242\275\240\273\007;v\326\331=>7\006=&X\226\2758_>>\362\370&\275\202\230m\275\232\330><\322\347%\276\201\376+\276fC\347=\306.\351=\247a\003\2764\336\r\276\033zH\274d\367\305\274vy!>\260]n\274@\265+;\n@\005>,(+\276\211\023\352\275\nH=\275\307\t\326=^\316\306\274Wi\311=,\341\'>-\005\217=R\263\024\276\022\362\022=\226\275\"=6\227)\276\227\304G\2766 \016=\277-\340\275\006\253\264=\250\266M=\020S\274\275\236x>\275\220\032\256\275\213?\'>\351\010\303\275^&4\273k\3433>\266\224k\275\370\204\220\275\274\257\323< \340\256=\246n\006\276SX<\276\214\203\303=J/\002\2768\233\022\276\331\214\233\275\311\023C=\230`\347=+\214I\275\004R+>\321\037\016\276\346p\266\275)\303\316\275\365\257\263\275\025\256)=\233\302\250=&\256\024\276\231\030@\276\374\033\031\274;\276!\276\3669\237\275\2406X\275uF\244=7\201\001>D\255]\275\014dG\276M\367>\275\363\326\022>\t\201\331\275\265\2200\2752\354]\275\241\303\031\276\275\2778\276P%\032<\327\231\364<!\217\312\275\254#\357\2759\017\023>\267\202#=<\3019\274\250=7\275\202\376\316\275F\273\315=\242Gs<\t\031%=\220n:\276o\033D>N\257\314=V\025\377\275\007m\262=\352\325G\276\264\357\340=\177\251\272=?\270j\275\377\214!\276\262\334/\275/\222\347\275\200Zs\275/\376r\275\261\000\254<\245\214#=i\241\027\276\353\271\345\274\347\225\010\275T\264\000\276\225kE\276V\246\036>q\232\027>\023\031\244=w\345\253=\216\301\004>\254\006\031>0\303\000=\ru\336=\210\017\007>sD\327=.\3245>aZ\232;v@\013\276\335\300Z\275a\201?>\261K\017>\202;;>\204\227\326=B\354\377=Pg\013\276\377\200\315<\241v\267\275\rk\312<\216K\002>\252\\H\275\034\'\">\363m\202=\312\021\005\276\321T7\276\375\035\304=\203\374\347\274}z\325\275\014\303o=\023\320~=\372\205\306=\255v\225;\352~\t\276<\034\037\2767\3548>\364:c\275\004\001\241\275h*\376\274\340n\253\275r%Q\275\206\321(>\031\365\037:\347\226\027>\246\367\321\275Wc%>*\206\243\275<^]\275\222\326*\275I\036\332\275\2469:\276\233cJ;\345\373\252=\001\207H>\330\031\t\275\341c9>\371z\205\275=\036=\276\347(\010>\203\346\245=m\247\">\311\214\264=i\231\377\274\207\303\302<\222\311\004>\373o\373=5\224\304\275\216\333i\275y\327\266=\340w\311=\202*\271\275K\277\227\275\340&\341\275\205\357I\276\"\3137\276\034~*\276\266\337\t\275o\267\020>u3F>\3550;\276b\362\336=\231\020\t\275H\325\251\275r8\t>`\221\"\275\332\305!\275}\375\360\275X8h\274\034\206\236=\267\3669>,)#\276l\376\020>\241(\363=\221nP=\201U*\276\303\373E\276"
      }
    }
  }
}
node {
  name: "fully_connected_1/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/weights/Assign"
  op: "Assign"
  input: "fully_connected_1/weights"
  input: "fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/weights/read"
  op: "Identity"
  input: "fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/MatMul"
  op: "MatMul"
  input: "fully_connected/Relu"
  input: "fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "fully_connected_1/bias/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "fully_connected_1/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "fully_connected_1/bias/Assign"
  op: "Assign"
  input: "fully_connected_1/bias"
  input: "fully_connected_1/bias/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "fully_connected_1/bias/read"
  op: "Identity"
  input: "fully_connected_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fully_connected_1/BiasAdd"
  op: "BiasAdd"
  input: "fully_connected_1/MatMul"
  input: "fully_connected_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.X"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary/tag"
  input: "fully_connected_1/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.y"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_1"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_1/tag"
  input: "output"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.866025388241
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.866025388241
      }
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 38
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/weights/Initializer/random_uniform/max"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/weights/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/weights/Initializer/random_uniform/mul"
  input: "linear_regression/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/weights"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/weights/Assign"
  op: "Assign"
  input: "linear_regression/weights"
  input: "linear_regression/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/weights/read"
  op: "Identity"
  input: "linear_regression/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 4
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.73205077648
      }
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 42
    }
  }
  attr {
    key: "seed2"
    value {
      i: 48
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/sub"
  op: "Sub"
  input: "linear_regression/bias/Initializer/random_uniform/max"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform/mul"
  op: "Mul"
  input: "linear_regression/bias/Initializer/random_uniform/RandomUniform"
  input: "linear_regression/bias/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias/Initializer/random_uniform"
  op: "Add"
  input: "linear_regression/bias/Initializer/random_uniform/mul"
  input: "linear_regression/bias/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/bias"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "linear_regression/bias/Assign"
  op: "Assign"
  input: "linear_regression/bias"
  input: "linear_regression/bias/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "linear_regression/bias/read"
  op: "Identity"
  input: "linear_regression/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.weights"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_2"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_2/tag"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3/tag"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "linear_regression.bias"
      }
    }
  }
}
node {
  name: "linear_regression/HistogramSummary_3"
  op: "HistogramSummary"
  input: "linear_regression/HistogramSummary_3/tag"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  op: "MatMul"
  input: "fully_connected_1/BiasAdd"
  input: "linear_regression/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  op: "BiasAdd"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b/MatMul"
  input: "linear_regression/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/sub"
  op: "Sub"
  input: "output"
  input: "linear_regression/mean_squared_error_regressor/xw_plus_b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mul"
  op: "Mul"
  input: "linear_regression/mean_squared_error_regressor/sub"
  input: "linear_regression/mean_squared_error_regressor/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "linear_regression/mean_squared_error_regressor/range"
  op: "Range"
  input: "linear_regression/mean_squared_error_regressor/range/start"
  input: "linear_regression/mean_squared_error_regressor/Rank"
  input: "linear_regression/mean_squared_error_regressor/range/delta"
}
node {
  name: "linear_regression/mean_squared_error_regressor/Mean"
  op: "Mean"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "ScalarSummary/tags"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "loss"
      }
    }
  }
}
node {
  name: "ScalarSummary"
  op: "ScalarSummary"
  input: "ScalarSummary/tags"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "MergeSummary/MergeSummary"
  op: "MergeSummary"
  input: "HistogramSummary"
  input: "HistogramSummary_1"
  input: "linear_regression/HistogramSummary"
  input: "linear_regression/HistogramSummary_1"
  input: "linear_regression/HistogramSummary_2"
  input: "linear_regression/HistogramSummary_3"
  input: "ScalarSummary"
  attr {
    key: "N"
    value {
      i: 7
    }
  }
}
node {
  name: "learning_rate/Initializer/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10000000149
      }
    }
  }
}
node {
  name: "learning_rate"
  op: "Variable"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "learning_rate/Assign"
  op: "Assign"
  input: "learning_rate"
  input: "learning_rate/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "learning_rate/read"
  op: "Identity"
  input: "learning_rate"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "gradients/Fill"
  op: "Fill"
  input: "gradients/Shape"
  input: "gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  op: "Rank"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/range"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  op: "Range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/start"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range/delta"
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  op: "Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_1"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill/value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/range"
  input: "linear_regression/mean_squared_error_regressor/range"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Fill"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  op: "Div"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  op: "Reshape"
  input: "gradients/Fill"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Tile"
  op: "Tile"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Reshape"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/floordiv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_3"
  op: "Shape"
  input: "linear_regression/mean_squared_error_regressor/Mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Rank_1"
  op: "Rank"
  input: "gradients/linear_regression/mean_squared_error_regressor/Mean_grad/Shape_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
